%P5_8.m
%地震面波频散模拟
f1=0.05;f2=0.053;   %两种波的频率
w1=2*pi*f1;w2=2*pi*f2;   %两种波的角频率
c1=3.5;c2=3.45;     %两种波的速度
k1=w1/c1;k2=w2/c2;   %两种波的波数
U=(w2-w1)/(k2-k1)    %这两种波传播的群速度，根据（5-4-3）式给出
c=mean([c1,c2])    %这两种波传播的相速度
x100=100;x150=150;x200=200;x250=250;x300=300;x350=350;   %震中距
t=0:1:800;   %时间
y100=cos(w1*t-k1*x100)+cos(w2*t-k2*x100);  %100km处的波形
y100b=2*cos((w2-w1)/2*t-(k2-k1)/2*x100);  %100km处的波形的包络线
y150=cos(w1*t-k1*x150)+cos(w2*t-k2*x150);%150km处的波形
y150b=2*cos((w2-w1)/2*t-(k2-k1)/2*x150);%150km处的波形的包络线
y200=cos(w1*t-k1*x200)+cos(w2*t-k2*x200);%200km处的波形
y200b=2*cos((w2-w1)/2*t-(k2-k1)/2*x200);%200km处的波形的包络线
y250=cos(w1*t-k1*x250)+cos(w2*t-k2*x250);%250km处的波形
y250b=2*cos((w2-w1)/2*t-(k2-k1)/2*x250);%250km处的波形的包络线
y300=cos(w1*t-k1*x300)+cos(w2*t-k2*x300);%300km处的波形
y300b=2*cos((w2-w1)/2*t-(k2-k1)/2*x300);%300km处的波形的包络线
y350=cos(w1*t-k1*x350)+cos(w2*t-k2*x350);%350km处的波形
y350b=2*cos((w2-w1)/2*t-(k2-k1)/2*x350);%350km处的波形的包络线
level=22;
plot(t,y100+level,'b',t,y100b+level,'r:',t,-y100b+level,'r:')   %绘制100km处的波形和包络线
hold on;plot(t(185)*[1,1],[-2,+2]+level,'k') %选择第185个点的相位
plot(t(204),level,'.')    %找到第204个点作为波包的计算点（波动能量的最低点）
text(800,level,'x=100km')   %给出震中距标记

level=18
plot(t,y150+level,'b',t,y150b+level,'r:',t,-y150b+level,'r:') %150km处的波形的包络线
plot((t(185)+50/c)*[1,1],[-2,2]+level,'k')  %计算出相位在50km的传播所需的时间
plot(t(203)+50/U,level,'.')  %计算出波包在50km的传播所需的时间
text(800,level,'x=150km')%给出震中距标记

level=14;
plot(t,y200+level,'b',t,y200b+level,'r:',t,-y200b+level,'r:') %200km处的波形的包络线
plot((t(185)+100/c)*[1,1],[-2,2]+level,'k') %计算出相位在100km的传播所需的时间
plot(t(204)+100/U,level,'.')%计算出波包在100km的传播所需的时间
text(800,level,'x=200km')%给出震中距标记

level=10;
plot(t,y250+level,'b',t,y250b+level,'r:',t,-y250b+level,'r:')%250km处的波形的包络线
plot((t(185)+150/c)*[1,1],[-2,2]+level,'k') %计算出相位在150km的传播所需的时间
plot(t(204)+150/U,level,'.') %计算出波包在150km的传播所需的时间
text(800,level,'x=250km')%给出震中距标记

level=6;
plot(t,y300+level,'b',t,y300b+level,'r:',t,-y300b+level,'r:')%300km处的波形的包络线
plot((t(185)+200/c)*[1,1],[-2,2]+level,'k') %计算出相位在200km的传播所需的时间
plot(t(204)+200/U,level,'.') %计算出波包在200km的传播所需的时间
text(800,level,'x=300km')%给出震中距标记

level=2;
plot(t,y350+level,'b',t,y350b+level,'r:',t,-y350b+level,'r:')%350km处的波形的包络线
plot((t(185)+250/c)*[1,1],[-2,+2]+level,'k') %计算出相位在250km的传播所需的时间
plot(t(204)+250/U,level,'.') %计算出波包在250km的传播所需的时间
text(800,level,'x=350km')%给出震中距标记
xlabel('时间/s')    %横轴的标记
text(253,12,'群速度','rotation',-70)   %给出群速度的标记，使字体旋转-70度
text(215,12,'相速度','rotation',-80)   %给出相速度的标记，使字体旋转-80度
